# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки
# типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.


my_list = ['Natan', 'Zlatan', 32, 12.5, True]


for el in my_list:
    print(type(el))
